Revit 2027 API
ISaveSharedCoordinatesCallback Interface
 An interface that may be used to control Revit when trying to unload or reload a Revit link with changes in shared coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ISaveSharedCoordinatesCallback
Public Interface ISaveSharedCoordinatesCallback
public interface class ISaveSharedCoordinatesCallback
type ISaveSharedCoordinatesCallback = interface end
The ISaveSharedCoordinatesCallback type exposes the following members.
Methods
Name | Description
GetSaveModifiedLinksOption |  Determines whether Revit should save the link, not save the link, or discard shared positioning entirely.
Top
See Also
Reference
Autodesk.Revit.DB Namespace